app/Http/Controllers/AddProductController.php

select * from `orders` left join `provides` on `orders`.`provide_id` = `provides`.`id`
---
        }

        //Nhà cung cấp
        $provides = Orders::leftjoin('provides', 'orders.provide_id', '=', 'provides.id')->get();

select * from `orders` order by `id` desc
---
        }

        $productIds = array();
        $order = Orders::orderByDesc('id')->get();

select * from `products` where `products`.`id` in ('')
select * from `orders` left join `provides` on `orders`.`provide_id` = `provides`.`id` left join `users` on `orders`.`users_id` = `users`.`id`
---
        }
        $perPage = $request->input('perPageinput', 25);
        $orders = $this->orders->getAllOrders($filters, $perPage, $status, $provide_namearr, $name, $date, $keywords, $sortBy, $sortType);
        $product = ProductOrders::with('getCodeProduct')
            ->join('orders', 'productorders.order_id', '=', 'orders.id')
            ->whereIn('orders.id', $productIds)
            ->get();
        $ordersNameAndProvide = Orders::leftjoin('provides', 'orders.provide_id', '=', 'provides.id')
            ->leftjoin('users', 'orders.users_id', '=', 'users.id')->get();