app/Http/Controllers/DashboardController.php

    public function count(Request $request)
    {
        $data = $request->all();
        $today = Carbon::today();
        // Xử lý lấy tất cả hơn nhập
        if ($data['data'] == 0) {
            $count = Orders::selectSub(function ($query) {
                $query->from('Orders')->where('orders.order_status', '=', 1)
                    ->selectRaw('count(id)');
            }, 'countID')
                ->selectSub(function ($query) {
                    $query->from('Orders')->where('orders.order_status', '=', 1)
                        ->selectRaw('SUM(total_tax)');
                }, 'sumTotal') // Lấy ngày created_at bé nhất
                ->selectSub(function ($query) {
                    $query->from('Orders')->where('orders.order_status', '=', 1)
                        ->selectRaw('MIN(created_at)');
                }, 'minCreatedAt')
                ->first();
---
select (select count(id) from `Orders` where `orders`.`order_status` = 1) as `countID`, (select SUM(total_tax) from `Orders` where `orders`.`order_status` = 1) as `sumTotal`, (select MIN(created_at) from `Orders` where `orders`.`order_status` = 1) as `minCreatedAt` from `orders` limit 1

    public function countExport(Request $request)
    {
        $data = $request->all();
        $today = Carbon::today();
        // Xử lý lấy tất cả hơn xuất
        if ($data['data'] == 0) {
            $count = Exports::selectSub(function ($query) {
                $query->from('exports')->where('exports.export_status', '=', 2)
                    ->selectRaw('count(id)');
            }, 'countExport')
                ->selectSub(function ($query) {
                    $query->from('exports')->where('exports.export_status', '=', 2)
                        ->selectRaw('SUM(total)');
                }, 'sumExport') // Lấy ngày created_at bé nhất
                ->selectSub(function ($query) {
                    $query->from('exports')->where('exports.export_status', '=', 2)
                        ->selectRaw('MIN(created_at)');
                }, 'minCreatedAt')
                ->first();
---
select (select count(id) from `exports` where `exports`.`export_status` = 2) as `countExport`, (select SUM(total) from `exports` where `exports`.`export_status` = 2) as `sumExport`, (select MIN(created_at) from `exports` where `exports`.`export_status` = 2) as `minCreatedAt` from `exports` limit 1

    public function countInventory(Request $request)
    {
        $data = $request->all();
        $today = Carbon::today();
        // Xử lý lấy tất cả hơn nhập
        if ($data['data'] == 0) {
            $count = Product::selectSub(function ($query) {
                $query->from('product')->where('product.product_qty', '>', 0)
                    ->selectRaw('count(id)');
            }, 'countInventory')
                ->selectSub(function ($query) {
                    $query->from('product')->where('product.product_qty', '>', 0)
                        ->selectRaw('SUM(product_total)');
                }, 'sumInventory') // Lấy ngày created_at bé nhất
                ->selectSub(function ($query) {
                    $query->from('product')->where('product.product_qty', '>', 0)
                        ->selectRaw('MIN(created_at)');
                }, 'minCreatedAt')
                ->first();
---
select (select count(id) from `product` where `product`.`product_qty` > 0) as `countInventory`, (select SUM(product_total) from `product` where `product`.`product_qty` > 0) as `sumInventory`, (select MIN(created_at) from `product` where `product`.`product_qty` > 0) as `minCreatedAt` from `product` limit 1

    public function countDebt(Request $request)
    {
        $data = $request->all();
        $today = Carbon::today();
        $data1 = [];
        // Xử lý lấy tất cả hơn nhập
        if ($data['data'] == 0) {
            $count = Debt::selectSub(function ($query) {
                $query->from('debts')->where('debt_status', '!=', 1)
                    ->selectRaw('SUM(total_sales)');
            }, 'count')->selectSub(function ($query) {
                $query->from('debts')->where('debt_status', '!=', 1)
                    ->selectRaw('MIN(created_at)');
            }, 'exportCreatedAt')->first();
            $countDebtImport = DebtImport::selectSub(function ($query) {
                $query->from('debt_import')->where('debt_status', '!=', 1)
                    ->selectRaw('SUM(total_import)');
            }, 'countDebtImport')->selectSub(function ($query) {
                $query->from('debt_import')->where('debt_status', '!=', 1)
                    ->selectRaw('MIN(created_at)');
            }, 'importCreatedAt')->first();
---
select (select SUM(total_sales) from `debts` where `debt_status` != 1) as `count`, (select MIN(created_at) from `debts` where `debt_status` != 1) as `exportCreatedAt` from `debts` limit 1
select (select SUM(total_import) from `debt_import` where `debt_status` != 1) as `countDebtImport`, (select MIN(created_at) from `debt_import` where `debt_status` != 1) as `importCreatedAt` from `debt_import` limit 1

    public function countProfit(Request $request)
    {
        $data = $request->all();
        $today = Carbon::today();
        // Xử lý lấy tất cả hơn nhập
        if ($data['data'] == 0) {
            $count = Debt::selectSub(function ($query) {
                $query->from('debts')
                    ->selectRaw('sum(total_difference)');
            }, 'countProfit')
                // Lấy ngày created_at bé nhất
                ->selectSub(function ($query) {
                    $query->from('debts')
                        ->selectRaw('MIN(created_at)');
                }, 'minCreatedAt')
                ->first();
---
select (select sum(total_difference) from `debts`) as `countProfit`, (select MIN(created_at) from `debts`) as `minCreatedAt` from `debts` limit 1

    public function test()
    {
        // Thử lấy dữ liệu từ cache
        $products = Cache::remember('products_cache', 50, function () {
            return Product::all();
        });
---
select * from `product`