app/Http/Controllers/ProductController.php

select * from `product` left join `provides` on `provides`.`id` = `product`.`provide_id` where `product`.`product_qty` > 0
---
            array_push($string, ['label' => 'Thuế:', 'values' => $taxarr, 'class' => 'tax']);
        }
        $perPage = $request->input('perPageinput', 25);
        $provide = Product::leftJoin('provides', 'provides.id', '=', 'product.provide_id')->where('product.product_qty', '>', 0)->get();

select * from `product`
---

        $title = 'Tồn kho';

        $product_order = Product::all();