app/Models/Orders.php

    public function getAllOrders($filter = [], $perPage, $status = [], $provide_name = [], $name = [], $date = [], $keywords = null, $orderBy = null, $orderType = null)
    {
        $productIds = array();
        $order = Orders::orderByDesc('id')->get();
---
select * from `orders` order by `id` desc

    public function allNhaphang()
    {
        $orders = DB::table($this->table)
            ->where('orders.order_status', '=', 1)
            ->get();
---
select * from `orders` where `orders`.`order_status` = 1

    public function getMinDateOrders()
    {
        $minDate = DB::table($this->table)
            ->selectRaw('MIN(DATE(created_at)) AS min_date')
            ->first();
---
select MIN(DATE(created_at)) AS min_date from `orders` limit 1