app/Models/Product.php

            });
        }
        $products = $products->where('product.product_qty', '>', 0);
        $products = $products->orderBy('product.created_at', 'asc')->paginate($perPage);
---
select `product`.*, `provides`.`provide_name` as `provide`, `product`.`product_qty` as `soluong` from `product` left join `provides` on `provides`.`id` = `product`.`provide_id` where `product`.`product_qty` > 0 order by `created_at` desc, `product`.`created_at` asc limit 10 offset 0
select count(*) as aggregate from `product` left join `provides` on `provides`.`id` = `product`.`provide_id` where `product`.`product_qty` > 0